Revit 2026 API

# AnalysisResultSchemaScale Property

---

Multiplier used for displaying diagram or vector values in view.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Scale { get; set; }
```
```vb
Public Property Scale As Double
	Get
	Set
```
```cpp
public:
property double Scale {
	double get ();
	void set (double value);
}
```
```fsharp
member Scale : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: scale is zero or negative |

#### Reference

AnalysisResultSchema Class

Autodesk.Revit.DB.Analysis Namespace